// ! Завдання 1:
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// ? Рішення:
// let number = Number(prompt("Введіть число"));
// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// console.log(number);

// ! Завдання 2:
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// ?Рішення:
// const min = Math.floor(Math.random() * 60);

// let quarter;

// if (min >= 0 && min < 15) {
//   quarter = "першу";
// } else if (min >= 15 && min < 30) {
//   quarter = "другу";
// } else if (min >= 30 && min < 45) {
//   quarter = "третю";
// } else {
//   quarter = "четверту";
// }

// alert(`${min} входить у ${quarter} чверть`);

// !Завдання 3:
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// ? Рішення:
// function seas() {
//   let num = prompt("Введіть число від 1 до 4 включно");
//   let result;
//   switch (num) {
//     case "1":
//       result = "Зима";
//       break;
//     case "2":
//       result = "Весна";
//       break;
//     case "3":
//       result = "Літо";
//       break;
//     case "4":
//       result = "Осінь";
//       break;
//     default:
//       result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
//       break;
//   }
//   return result;
// }

// console.log(seas());

// ! Завдання 4:
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// ? Рішення:
// let amount = prompt("Введіть час");
// let padded = Number(amount);
// let hours = Math.floor(padded / 60);
// let lolo = padded % 60;
// hours = hours.toString();
// lolo = lolo.toString();
// hours = hours.padStart(2, "0");
// lolo = lolo.padStart(2, "0");
// let end = `${hours}:${lolo}`;
// console.log(end);

// let minutes = Number(prompt("Введіть час у хвилинах"));

// let hours = Math.floor(minutes / 60)
//   .toString()
//   .padStart(2, "0");
// let mins = (minutes % 60).toString().padStart(2, "0");

// console.log(`${hours}:${mins}`);

// ! Завдання 5:
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

//? Рішення:
// let login = prompt("Введіть свій логін");
// console.log(login);

// if (login === "Адмін") {
//   let password = prompt("Введіть пароль");
//   if (password === "Я головний") {
//     alert("Добрий день!");
//   } else {
//     alert("Невірний пароль!");
//   }
// } else if (login === "") {
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }

// ! Завдання 6:
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// ? Рішення:
// let count = 0;
// while (count <= 20) {
//   console.log(count);
//   count += 1;
// }

// ! Завдання 7:
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// ? Рішення:
// function getNumbers(min, max) {
//   let lala = 0;

//   for (let i = max; i > min; i--) {
//     console.log(i);

//     if (i % 2 === 0) {
//       lala = lala + i;
//     }
//   }
//   return lala;
// }

// console.log(getNumbers(1, 30));

// ! Завдання 8:
//  Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// ? Рішення:
// function min(a, b) {
//   if (isNaN(a)) {
//     return "Not a number";
//   }

//   if (isNaN(b)) {
//     return "Not a nummber";
//   }
//   let minn = Math.min(a, b);

//   return minn;
// }

// console.log(min(46, 10));

// ! Завдання 9:
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// ? Рішення:
// function isAdult(age) {
//   return age >= 18 || confirm("Вам є 18?");
// }

// console.log(isAdult(17));

// ! Завдання 10:
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// ? Рішення:
// function fizzBuzz(num) {
//   for (let i = 1; i <= num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log("fizzbuzz");
//     } else if (i % 3 === 0) {
//       console.log("fizz");
//     } else if (i % 5 === 0) {
//       console.log("buzz");
//     }
//   }
// }

// console.log(fizzBuzz(20));
