// !Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// ?let number = Number(prompt("Введіть число"));
// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// console.log(number);

// !У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// ?const min = Math.floor(Math.random() * 60);

// let quarter;

// if (min >= 0 && min < 15) {
//   quarter = "першу";
// } else if (min >= 15 && min < 30) {
//   quarter = "другу";
// } else if (min >= 30 && min < 45) {
//   quarter = "третю";
// } else {
//   quarter = "четверту";
// }

// alert(`${min} входить у ${quarter} чверть`);

// !Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// ? function seas() {
//   let num = prompt("Введіть число від 1 до 4 включно");
//   let result;
//   switch (num) {
//     case "1":
//       result = "Зима";
//       break;
//     case "2":
//       result = "Весна";
//       break;
//     case "3":
//       result = "Літо";
//       break;
//     case "4":
//       result = "Осінь";
//       break;
//     default:
//       result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
//       break;
//   }
//   return result;
// }

// console.log(seas());

// !Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// ? let amount = prompt("Введіть час");
// let padded = Number(amount);
// let hours = Math.floor(padded / 60);
// let lolo = padded % 60;
// hours = hours.toString();
// lolo = lolo.toString();
// hours = hours.padStart(2, "0");
// lolo = lolo.padStart(2, "0");
// let end = `${hours}:${lolo}`;
// console.log(end);

// let minutes = Number(prompt("Введіть час у хвилинах"));

// let hours = Math.floor(minutes / 60)
//   .toString()
//   .padStart(2, "0");
// let mins = (minutes % 60).toString().padStart(2, "0");

// console.log(`${hours}:${mins}`);

// ! Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"
